Autodesk.Revit.DB.BoundarySegmentArray
An array that contains boundary segments.

Autodesk.Revit.DB.BoundarySegmentArray.Insert(Autodesk.Revit.DB.BoundarySegment,System.Int32)
System.Int32
Insert the specified boundary segment into the array.
item: The boundary segment to be inserted into the array.
index: The boundary segment will be inserted before this index.
Returns: Returns whether the boundary segment was inserted into the array.

Autodesk.Revit.DB.BoundarySegmentArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.BoundarySegmentArray.ReverseIterator
Autodesk.Revit.DB.BoundarySegmentArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.BoundarySegmentArray.ForwardIterator
Autodesk.Revit.DB.BoundarySegmentArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.BoundarySegmentArray.Append(Autodesk.Revit.DB.BoundarySegment)
void
Add the boundary segment to the end of the array.
item: The boundary segment to be added.

Autodesk.Revit.DB.BoundarySegmentArray.Clear
void
Removes every boundary segment from the array, rendering it empty.

Autodesk.Revit.DB.BoundarySegmentArray.Size
System.Int32
get
Returns the number of boundary segments that are in the array.

Autodesk.Revit.DB.BoundarySegmentArray.Item(System.Int32)
System.Object
Gets or sets a boundary segment at a specified index within the array.
index: The index of the boundary segment to be set or retrieved.
Returns: Returns the boundary segment at the specified index.

Autodesk.Revit.DB.BoundarySegmentArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.